# Employee SQL Tutorial for Beginners

Welcome! This notebook will teach you SQL using an employee database.

## Database Overview

We have 4 tables:
- **departments** - Company departments
- **employees** - Employee information
- **projects** - Company projects
- **employee_projects** - Who works on which project

---

## Setup - Run this first!

In [2]:
import sqlite3
import pandas as pd

# Connect to database
conn = sqlite3.connect('employee.db')

# Helper function to run SQL queries
def run_sql(query):
    return pd.read_sql_query(query, conn)

print("Connected to employee database!")

Connected to employee database!

## Let's Look at Our Tables First

In [3]:
# View the departments table
run_sql("SELECT * FROM departments")

   department_id  department_name    location
0              1      Engineering  Building A
1              2        Marketing  Building B
2              3  Human Resources  Building A
3              4          Finance  Building C
4              5            Sales  Building B

In [4]:
# View the employees table
run_sql("SELECT * FROM employees")

,employee_id,first_name,last_name,email,hire_date,salary,department_id,job_title
0,1,John,Smith,john.smith@company.com,2020-01-15,75000.0,1,Software Engineer
1,2,Sarah,Johnson,sarah.j@company.com,2019-03-20,85000.0,1,Senior Engineer
2,3,Mike,Williams,mike.w@company.com,2021-06-01,65000.0,2,Marketing Specialist
3,4,Emily,Brown,emily.b@company.com,2018-09-10,95000.0,1,Tech Lead
4,5,David,Jones,david.j@company.com,2022-02-14,55000.0,5,Sales Representative
5,6,Lisa,Garcia,lisa.g@company.com,2020-07-22,70000.0,2,Marketing Manager
6,7,James,Miller,james.m@company.com,2019-11-05,60000.0,3,HR Specialist
7,8,Anna,Davis,anna.d@company.com,2021-04-18,80000.0,4,Financial Analyst
8,9,Robert,Wilson,robert.w@company.com,2017-08-30,110000.0,1,Engineering Manager
9,10,Jennifer,Taylor,jennifer.t@company.com,2022-01-10,52000.0,5,Sales Associate
10,11,Michael,Anderson,michael.a@company.com,2020-05-25,72000.0,4,Accountant
11,12,Jessica,Thomas,jessica.t@company.com,2018-12-01,88000.0,3,HR Manager
12,13,William,Jackson,william.j@company.com,2023-03-15,58000.0,1,Junior Developer
13,14,Ashley,White,ashley.w@company.com,2021-09-08,67000.0,2,Content Creator
14,15,Christopher,Harris,chris.h@company.com,2019-06-12,78000.0,5,Sales Manager

In [5]:
# View the projects table
run_sql("SELECT * FROM projects")

   project_id            project_name  start_date    end_date    budget
0           1        Website Redesign  2024-01-01  2024-06-30  150000.0
1           2  Mobile App Development  2024-02-15  2024-12-31  300000.0
2           3   Marketing Campaign Q1  2024-01-01  2024-03-31   50000.0
3           4       HR System Upgrade  2024-03-01  2024-09-30   80000.0
4           5  Sales Training Program  2024-04-01        None   25000.0

In [ ]:
# View the employee_projects table
run_sql("SELECT * FROM employee_projects")

    employee_id  project_id                  role  hours_worked
0             1           1             Developer           120
1             2           1        Lead Developer           200
2             4           1       Project Manager            80
3             1           2             Developer           150
4             2           2        Lead Developer           180
5             9           2     Technical Advisor            40
6            13           2      Junior Developer           200
7             3           3       Content Creator           100
8             6           3      Campaign Manager           120
9            14           3              Designer            80
10            7           4  Requirements Analyst            60
11           12           4          Project Lead           100
12            5           5               Trainer            40
13           10           5           Participant            20
14           15           5          Program Lead            50

---
#SQL Practice Problems

Try to solve each problem yourself first, then check the answer below!

---

## Problem 1: SELECT All Employees
**Question:** Get all columns from the `employees` table.

**Hint:** Use `SELECT * FROM table_name`

In [7]:
# Write your answer here:
run_sql("""
    SELECT * FROM employees
""")

,employee_id,first_name,last_name,email,hire_date,salary,department_id,job_title
0,1,John,Smith,john.smith@company.com,2020-01-15,75000.0,1,Software Engineer
1,2,Sarah,Johnson,sarah.j@company.com,2019-03-20,85000.0,1,Senior Engineer
2,3,Mike,Williams,mike.w@company.com,2021-06-01,65000.0,2,Marketing Specialist
3,4,Emily,Brown,emily.b@company.com,2018-09-10,95000.0,1,Tech Lead
4,5,David,Jones,david.j@company.com,2022-02-14,55000.0,5,Sales Representative
5,6,Lisa,Garcia,lisa.g@company.com,2020-07-22,70000.0,2,Marketing Manager
6,7,James,Miller,james.m@company.com,2019-11-05,60000.0,3,HR Specialist
7,8,Anna,Davis,anna.d@company.com,2021-04-18,80000.0,4,Financial Analyst
8,9,Robert,Wilson,robert.w@company.com,2017-08-30,110000.0,1,Engineering Manager
9,10,Jennifer,Taylor,jennifer.t@company.com,2022-01-10,52000.0,5,Sales Associate
10,11,Michael,Anderson,michael.a@company.com,2020-05-25,72000.0,4,Accountant
11,12,Jessica,Thomas,jessica.t@company.com,2018-12-01,88000.0,3,HR Manager
12,13,William,Jackson,william.j@company.com,2023-03-15,58000.0,1,Junior Developer
13,14,Ashley,White,ashley.w@company.com,2021-09-08,67000.0,2,Content Creator
14,15,Christopher,Harris,chris.h@company.com,2019-06-12,78000.0,5,Sales Manager

---
## Problem 2: SELECT Specific Columns
**Question:** Get only `first_name`, `last_name`, and `salary` from employees.

**Hint:** List column names separated by commas

In [8]:
# Write your answer here:
run_sql("""
    SELECT first_name,last_name,salary FROM employees
""")

     first_name last_name    salary
0          John     Smith   75000.0
1         Sarah   Johnson   85000.0
2          Mike  Williams   65000.0
3         Emily     Brown   95000.0
4         David     Jones   55000.0
5          Lisa    Garcia   70000.0
6         James    Miller   60000.0
7          Anna     Davis   80000.0
8        Robert    Wilson  110000.0
9      Jennifer    Taylor   52000.0
10      Michael  Anderson   72000.0
11      Jessica    Thomas   88000.0
12      William   Jackson   58000.0
13       Ashley     White   67000.0
14  Christopher    Harris   78000.0

---
## Problem 3: WHERE Clause - Filter by Department
**Question:** Find all employees in department_id = 1 (Engineering).

**Hint:** Use `WHERE column = value`

In [9]:
# Write your answer here:
run_sql("""
    SELECT * from employees where department_id = 1
""")

,employee_id,first_name,last_name,email,hire_date,salary,department_id,job_title
0,1,John,Smith,john.smith@company.com,2020-01-15,75000.0,1,Software Engineer
1,2,Sarah,Johnson,sarah.j@company.com,2019-03-20,85000.0,1,Senior Engineer
2,4,Emily,Brown,emily.b@company.com,2018-09-10,95000.0,1,Tech Lead
3,9,Robert,Wilson,robert.w@company.com,2017-08-30,110000.0,1,Engineering Manager
4,13,William,Jackson,william.j@company.com,2023-03-15,58000.0,1,Junior Developer

---
## Problem 4: Salary Filter
**Question:** Find all employees with salary greater than $70,000.

**Hint:** Use `WHERE salary > 70000`

In [13]:
#Write your answer here:
run_sql("""
        SELECT * FROM employees WHERE salary > 70000
        ORDER BY salary DESC
""")

,employee_id,first_name,last_name,email,hire_date,salary,department_id,job_title
0,9,Robert,Wilson,robert.w@company.com,2017-08-30,110000.0,1,Engineering Manager
1,4,Emily,Brown,emily.b@company.com,2018-09-10,95000.0,1,Tech Lead
2,12,Jessica,Thomas,jessica.t@company.com,2018-12-01,88000.0,3,HR Manager
3,2,Sarah,Johnson,sarah.j@company.com,2019-03-20,85000.0,1,Senior Engineer
4,8,Anna,Davis,anna.d@company.com,2021-04-18,80000.0,4,Financial Analyst
5,15,Christopher,Harris,chris.h@company.com,2019-06-12,78000.0,5,Sales Manager
6,1,John,Smith,john.smith@company.com,2020-01-15,75000.0,1,Software Engineer
7,11,Michael,Anderson,michael.a@company.com,2020-05-25,72000.0,4,Accountant

---
## Problem 5: ORDER BY Salary
**Question:** Get all employees ordered by salary from highest to lowest.

**Hint:** Use `ORDER BY column DESC`

In [14]:
#Write your answer here:
run_sql("""
    SELECT * FROM employees
    ORDER BY salary desc
""")

,employee_id,first_name,last_name,email,hire_date,salary,department_id,job_title
0,9,Robert,Wilson,robert.w@company.com,2017-08-30,110000.0,1,Engineering Manager
1,4,Emily,Brown,emily.b@company.com,2018-09-10,95000.0,1,Tech Lead
2,12,Jessica,Thomas,jessica.t@company.com,2018-12-01,88000.0,3,HR Manager
3,2,Sarah,Johnson,sarah.j@company.com,2019-03-20,85000.0,1,Senior Engineer
4,8,Anna,Davis,anna.d@company.com,2021-04-18,80000.0,4,Financial Analyst
5,15,Christopher,Harris,chris.h@company.com,2019-06-12,78000.0,5,Sales Manager
6,1,John,Smith,john.smith@company.com,2020-01-15,75000.0,1,Software Engineer
7,11,Michael,Anderson,michael.a@company.com,2020-05-25,72000.0,4,Accountant
8,6,Lisa,Garcia,lisa.g@company.com,2020-07-22,70000.0,2,Marketing Manager
9,14,Ashley,White,ashley.w@company.com,2021-09-08,67000.0,2,Content Creator
10,3,Mike,Williams,mike.w@company.com,2021-06-01,65000.0,2,Marketing Specialist
11,7,James,Miller,james.m@company.com,2019-11-05,60000.0,3,HR Specialist
12,13,William,Jackson,william.j@company.com,2023-03-15,58000.0,1,Junior Developer
13,5,David,Jones,david.j@company.com,2022-02-14,55000.0,5,Sales Representative
14,10,Jennifer,Taylor,jennifer.t@company.com,2022-01-10,52000.0,5,Sales Associate

---
## Problem 6: Top 5 Highest Paid
**Question:** Get the top 5 highest paid employees.

**Hint:** Combine `ORDER BY` and `LIMIT`

In [15]:
#Write your answer here:
run_sql("""
    SELECT * FROM employees
    ORDER BY salary DESC
    limit 5
""")

,employee_id,first_name,last_name,email,hire_date,salary,department_id,job_title
0,9,Robert,Wilson,robert.w@company.com,2017-08-30,110000.0,1,Engineering Manager
1,4,Emily,Brown,emily.b@company.com,2018-09-10,95000.0,1,Tech Lead
2,12,Jessica,Thomas,jessica.t@company.com,2018-12-01,88000.0,3,HR Manager
3,2,Sarah,Johnson,sarah.j@company.com,2019-03-20,85000.0,1,Senior Engineer
4,8,Anna,Davis,anna.d@company.com,2021-04-18,80000.0,4,Financial Analyst

---
## Problem 7: COUNT Employees per Department
**Question:** How many employees are in each department?

**Hint:** Use `COUNT(*)` with `GROUP BY`

In [24]:
#Write your answer here:
run_sql("""
    SELECT  d.department_id, department_name, COUNT(*) as count_per_department
    from employees s
    JOIN departments d
        ON d.department_id = s.department_id
    GROUP BY department_name

""")

   department_id  department_name  count_per_department
0              1      Engineering                     5
1              4          Finance                     2
2              3  Human Resources                     2
3              2        Marketing                     3
4              5            Sales                     3

---
## Problem 8: Average Salary
**Question:** What is the average salary of all employees?

**Hint:** Use `AVG(column)`

In [25]:
#Write your answer here:
run_sql("""
    SELECT avg(salary) from employees
""")

   avg(salary)
0      74000.0

---
## Problem 9: Average Salary per Department
**Question:** What is the average salary for each department?

**Hint:** Use `AVG(salary)` with `GROUP BY department_id`

In [32]:
# Write your answer here:
run_sql("""
    SELECT d.department_id,
    d.department_name,
    avg(e.salary) as avg_salary
    from employees e
    join departments d
        on e.department_id = d.department_id
    group by d.department_id
""")

   department_id  department_name    avg_salary
0              1      Engineering  84600.000000
1              2        Marketing  67333.333333
2              3  Human Resources  74000.000000
3              4          Finance  76000.000000
4              5            Sales  61666.666667

---
## Problem 10: JOIN - Employees with Department Names
**Question:** Show employee names with their department names (not just IDs).

 **Hint:** Use `JOIN departments ON employees.department_id = departments.department_id`

In [ ]:
#Write your answer here:
run_sql("""

""")

---
## Problem 11: SUM of Total Salary
**Question:** What is the total salary expense for the Engineering department (department_id = 1)?

**Hint:** Use `SUM(salary)` with `WHERE`

In [35]:
#Write your answer here:
run_sql("""
    select sum(salary) as total_salary,department_id
    from employees
    where department_id = 1

""")

   total_salary  department_id
0      423000.0              1

---
## Problem 12: MIN and MAX Salary
**Question:** What is the minimum and maximum salary in the company?

**Hint:** Use `MIN(salary)` and `MAX(salary)`

In [36]:
# Write your answer here:
run_sql("""
    SELECT min(salary) as min_salary,max(salary) as max_salary
    from employees
""")

   min_salary  max_salary
0     52000.0    110000.0

---
## Problem 13: BETWEEN - Salary Range
**Question:** Find employees with salary between $60,000 and $80,000.
**Hint:** Use `WHERE salary BETWEEN 60000 AND 80000`

In [38]:
#Write your answer here:
run_sql("""
    select * from employees
    WHERE salary between 60000 and 80000
""")

,employee_id,first_name,last_name,email,hire_date,salary,department_id,job_title
0,1,John,Smith,john.smith@company.com,2020-01-15,75000.0,1,Software Engineer
1,3,Mike,Williams,mike.w@company.com,2021-06-01,65000.0,2,Marketing Specialist
2,6,Lisa,Garcia,lisa.g@company.com,2020-07-22,70000.0,2,Marketing Manager
3,7,James,Miller,james.m@company.com,2019-11-05,60000.0,3,HR Specialist
4,8,Anna,Davis,anna.d@company.com,2021-04-18,80000.0,4,Financial Analyst
5,11,Michael,Anderson,michael.a@company.com,2020-05-25,72000.0,4,Accountant
6,14,Ashley,White,ashley.w@company.com,2021-09-08,67000.0,2,Content Creator
7,15,Christopher,Harris,chris.h@company.com,2019-06-12,78000.0,5,Sales Manager

---
## Problem 14: LIKE - Pattern Matching
**Question:** Find all employees whose job_title contains 'Manager'.

**Hint:** Use `LIKE '%Manager%'`

In [39]:
#Write your answer here:
run_sql("""
     SELECT * FROM employees
     where job_title like  '%Manager%'
""")

,employee_id,first_name,last_name,email,hire_date,salary,department_id,job_title
0,6,Lisa,Garcia,lisa.g@company.com,2020-07-22,70000.0,2,Marketing Manager
1,9,Robert,Wilson,robert.w@company.com,2017-08-30,110000.0,1,Engineering Manager
2,12,Jessica,Thomas,jessica.t@company.com,2018-12-01,88000.0,3,HR Manager
3,15,Christopher,Harris,chris.h@company.com,2019-06-12,78000.0,5,Sales Manager

---
## Problem 15: Multiple JOINs - Employee Project Details
**Question:** Show employee names, project names, and their roles on each project.

**Hint:** Join `employees`, `employee_projects`, and `projects` tables

In [50]:
#Write your answer here:
run_sql("""
    SELECT e.first_name,e.last_name,ep.role,p.project_name
    from employees e
    JOIN employee_projects ep
        on e.employee_id = ep.employee_id
    JOIN projects p
        on ep.project_id = p.project_id
    
""")

     first_name last_name                  role            project_name
0          John     Smith             Developer        Website Redesign
1         Sarah   Johnson        Lead Developer        Website Redesign
2         Emily     Brown       Project Manager        Website Redesign
3          John     Smith             Developer  Mobile App Development
4         Sarah   Johnson        Lead Developer  Mobile App Development
5        Robert    Wilson     Technical Advisor  Mobile App Development
6       William   Jackson      Junior Developer  Mobile App Development
7          Mike  Williams       Content Creator   Marketing Campaign Q1
8          Lisa    Garcia      Campaign Manager   Marketing Campaign Q1
9        Ashley     White              Designer   Marketing Campaign Q1
10        James    Miller  Requirements Analyst       HR System Upgrade
11      Jessica    Thomas          Project Lead       HR System Upgrade
12        David     Jones               Trainer  Sales Training Program
13     Jennifer    Taylor           Participant  Sales Training Program
14  Christopher    Harris          Program Lead  Sales Training Program

---
## Problem 16: HAVING - Filter Groups
**Question:** Find departments that have more than 2 employees.

**Hint:** Use `GROUP BY` with `HAVING COUNT(*) > 2`

In [42]:
#Write your answer here:
run_sql("""
    SELECT department_id,count(*) as employee_count
    from employees
    group by department_id
    having count(*) > 2
""")

   department_id  employee_count
0              1               5
1              2               3
2              5               3

In [ ]:
# Close the database connection when done
conn.close()
print("Database connection closed!")